app/views/events/_form.html.erb

    <%= form.label :committee %>
    <%= form.select :committee,
                     Event.committees.keys.map { |c| [c.humanize, c] },
                     {}, class: 'form-control', required: true,
                     data: { event_points_target: 'committee', action: 'change->event-points#recalculate' } %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]