app/views/photos/_photo.html.erb


    <% if photo.photo_tags.any? %>
---
SELECT "photos".* FROM "photos" ORDER BY "photos"."id" DESC