app/controllers/attendances_controller.rb

  def export
    attendances = @event.attendances.includes(:user).sort_by { |attendance| attendance.user.full_name.to_s.downcase }
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."user_id" = $2 LIMIT $3  [["event_id", 14], ["user_id", 23], ["LIMIT", 1]]

  def find_or_initialize_attendance
    @event.attendances.find_or_initialize_by(user: current_user).tap do |attendance|
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."user_id" = $2 LIMIT $3  [["event_id", 14], ["user_id", 23], ["LIMIT", 1]]