app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."start_time" BETWEEN $1 AND $2 ORDER BY "events"."start_time" ASC  [["start_time", "2026-09-01"], ["start_time", "2026-09-30"]]
---
  def index
    start_date = parse_start_date(params[:start_date])
    end_date = start_date.end_of_month

    @events = Event.where(start_time: start_date..end_date).order(:start_time)

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
---
  def show
    @attendances = Attendance.where(event: @event)

UPDATE "events" SET "updated_at" = $1, "start_time" = $2, "end_time" = $3 WHERE "events"."id" = $4  [["updated_at", "2024-11-18 04:53:01.922023"], ["start_time", "2024-11-17 21:36:00"], ["end_time", "2024-11-17 21:36:00"], ["id", 10]]
---
  def update
    if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 10]]
---
  def destroy
    if @event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find_by(id: params[:id])

INSERT INTO "events" ("name", "created_at", "updated_at", "passcode", "start_time", "end_time", "location", "description", "flyer_image_data", "series_id", "series_position", "recurrence_note", "committee") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create_single
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."start_time" BETWEEN $1 AND $2 ORDER BY "events"."start_time" ASC  [["start_time", "2026-10-01"], ["start_time", "2026-10-31"]]
---
  def load_calendar_month_for(event)
    start_date = event.start_time.to_date.beginning_of_month
    end_date = start_date.end_of_month
    @events = Event.where(start_time: start_date..end_date).order(:start_time)