app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos"."id" DESC
---
  def index
    @photos = Photo.order(id: :desc).includes(:photo_tags)

INSERT INTO "photos" ("image_data", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    handle_blank_photo and return if photo_params_blank?

    @photo = current_user.photos.build(photo_params)

    if @photo.save

UPDATE "photos" SET "image_data" = $1, "updated_at" = $2 WHERE "photos"."id" = $3
INSERT INTO "photos" ("image_data", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def update
    if @photo.update(photo_params)
      @photo.sync_tags(tag_names_param)