app/controllers/users_controller.rb

  def index
    sort_column = params[:sort] || 'full_name' # Default to sorting by full_name
    sort_direction = params[:direction] || 'asc' # Default to ascending order

    @users = User.order("#{sort_column} #{sort_direction}")
---
SELECT "users".* FROM "users" ORDER BY full_name desc

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "committee" = $1, "dues" = $2, "role" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["committee", ""], ["dues", ""], ["role", "member"], ["updated_at", "2026-10-06 18:53:54.144186"], ["id", 8]]