app/models/user.rb

  def self.to_csv(users = all)
    CSV.generate do |csv|
      csv << ['Full Name', 'Email', 'Committee', 'Role', 'Points', 'Dues']
      users.each { |user| csv << [user.full_name, user.email, user.committee, user.role, user.points.to_i, user.dues] }
---
INSERT INTO "users" ("email", "full_name", "uid", "avatar_url", "committee", "points", "dues", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cadenmiller@tamu.edu"], ["LIMIT", 1]]